<details ><summary>apply for monitoring 2025-03-07 11:54:36 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.grafana will be updated in-place
  ~ resource "cloudns_dns_record" "grafana" {
        id    = "584531033"
      ~ name  = "monitoring" -> (known after apply)
      ~ value = "4d9bd0h43pb35an6dd7r9a9l7k.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.grafana.module.grafana_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.prometheus.module.prometheus_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
module.prometheus.module.prometheus_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.prometheus.module.prometheus_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.prometheus.module.prometheus_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.prometheus.module.prometheus_deployment.akash_deployment.service: Creation complete after 28s [id=20533701:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [40s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 42s [id=20533702:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.grafana.module.grafana_deployment.akash_deployment.service: Creating...
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [40s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Creation complete after 41s [id=20533707:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.grafana: Modifying... [id=584531033]
cloudns_dns_record.grafana: Modifications complete after 1s [id=584531033]

Apply complete! Resources: 3 added, 1 changed, 0 destroyed.

```
</details>
</details>